InformationRegisters/ABCXYZКлассификацияНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ABCXYZКлассификацияНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Класс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.XYZКлассификация</v8:Type>
						<v8:Type>cfg:EnumRef.ABCКлассификация</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПараметраКлассификации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделКлассификации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипПараметраКлассификации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПараметровКлассификации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипКлассификации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКлассификации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыПараметровКлассификации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ТипыПараметровКлассификации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выручка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВаловаяПрибыль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Количество</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыКлассификации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ТипыКлассификации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ABC</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>XYZ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ABCКлассификация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ABCКлассификация</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>AКласс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>BКласс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CКласс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеКлассифицирован</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/XYZКлассификация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>XYZКлассификация</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>XКласс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>YКласс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ZКласс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеКлассифицирован</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/ABCXYZКлассификацияНоменклатуры/Forms/ABCXYZКлассификация/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда
	
		Возврат;
	
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Классификация.РазделКлассификации КАК Склад,
	|	Классификация.Характеристика КАК Характеристика,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА Классификация.ТипПараметраКлассификации = ЗНАЧЕНИЕ(Перечисление.ТипыПараметровКлассификации.Выручка)
	|					И Классификация.ТипКлассификации = ЗНАЧЕНИЕ(Перечисление.ТипыКлассификации.ABC)
	|				ТОГДА Классификация.Класс
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ) КАК ABCКлассВыручка,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА Классификация.ТипПараметраКлассификации = ЗНАЧЕНИЕ(Перечисление.ТипыПараметровКлассификации.Выручка)
	|					И Классификация.ТипКлассификации = ЗНАЧЕНИЕ(Перечисление.ТипыКлассификации.XYZ)
	|				ТОГДА Классификация.Класс
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ) КАК XYZКлассВыручка,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА Классификация.ТипПараметраКлассификации = ЗНАЧЕНИЕ(Перечисление.ТипыПараметровКлассификации.ВаловаяПрибыль)
	|					И Классификация.ТипКлассификации = ЗНАЧЕНИЕ(Перечисление.ТипыКлассификации.ABC)
	|				ТОГДА Классификация.Класс
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ) КАК ABCКлассВаловаяПрибыль,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА Классификация.ТипПараметраКлассификации = ЗНАЧЕНИЕ(Перечисление.ТипыПараметровКлассификации.ВаловаяПрибыль)
	|					И Классификация.ТипКлассификации = ЗНАЧЕНИЕ(Перечисление.ТипыКлассификации.XYZ)
	|				ТОГДА Классификация.Класс
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ) КАК XYZКлассВаловаяПрибыль,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА Классификация.ТипПараметраКлассификации = ЗНАЧЕНИЕ(Перечисление.ТипыПараметровКлассификации.Количество)
	|					И Классификация.ТипКлассификации = ЗНАЧЕНИЕ(Перечисление.ТипыКлассификации.ABC)
	|				ТОГДА Классификация.Класс
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ) КАК ABCКлассКоличество,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА Классификация.ТипПараметраКлассификации = ЗНАЧЕНИЕ(Перечисление.ТипыПараметровКлассификации.Количество)
	|					И Классификация.ТипКлассификации = ЗНАЧЕНИЕ(Перечисление.ТипыКлассификации.XYZ)
	|				ТОГДА Классификация.Класс
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ) КАК XYZКлассКоличество
	|ИЗ
	|	РегистрСведений.ABCXYZКлассификацияНоменклатуры.СрезПоследних(
	|			,
	|			Номенклатура = &Номенклатура
	|				И (РазделКлассификации = НЕОПРЕДЕЛЕНО
	|					ИЛИ ТИПЗНАЧЕНИЯ(РазделКлассификации) = ТИП(Справочник.Склады)
	|						И РазделКлассификации <> ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка))) КАК Классификация
	|
	|СГРУППИРОВАТЬ ПО
	|	Классификация.РазделКлассификации,
	|	Классификация.Характеристика
	|
	|УПОРЯДОЧИТЬ ПО
	|	Склад,
	|	Характеристика
	|ИТОГИ ПО
	|	Склад");
	
	Запрос.УстановитьПараметр("Номенклатура", Параметры.Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ABCXYZКлассификацияСклады = ABCXYZКлассификация.ПолучитьЭлементы();
		
		ВыборкаСклад = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаСклад.Следующий() Цикл
			
			ABCXYZКлассификацияСклад = ABCXYZКлассификацияСклады.Добавить();
			ABCXYZКлассификацияСклад.Склад = ВыборкаСклад.Склад;
			
			ABCXYZКлассификацияХарактеристики = ABCXYZКлассификацияСклад.ПолучитьЭлементы();
			
			ВыборкаХарактеристика = ВыборкаСклад.Выбрать();
			
			ДобавлятьХарактеристики = Истина;
			
			Пока ВыборкаХарактеристика.Следующий() Цикл
				
				Если ВыборкаХарактеристика.Количество() = 1 И ВыборкаХарактеристика.Характеристика.Пустая() Тогда
					
					ДобавлятьХарактеристики = Ложь;
					
				КонецЕсли;
				
				Если ДобавлятьХарактеристики Тогда
					
					ABCXYZКлассификацияХарактеристика = ABCXYZКлассификацияХарактеристики.Добавить();
					ABCXYZКлассификацияХарактеристика.Склад = ВыборкаХарактеристика.Характеристика;
					
					ABCXYZКлассификацияКласс = ABCXYZКлассификацияХарактеристика;
					
				Иначе
					
					ABCXYZКлассификацияКласс = ABCXYZКлассификацияСклад;
					
				КонецЕсли;
				
				ABCXYZКлассификацияКласс.Выручка = ПредставлениеКласса(ВыборкаХарактеристика.ABCКлассВыручка, ВыборкаХарактеристика.XYZКлассВыручка);
				ABCXYZКлассификацияКласс.ВаловаяПрибыль = ПредставлениеКласса(ВыборкаХарактеристика.ABCКлассВаловаяПрибыль, ВыборкаХарактеристика.XYZКлассВаловаяПрибыль);
				ABCXYZКлассификацияКласс.Количество = ПредставлениеКласса(ВыборкаХарактеристика.ABCКлассКоличество, ВыборкаХарактеристика.XYZКлассКоличество);
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ABCXYZКлассификацияСклад.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ABCXYZКлассификация.Склад");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'По всем складам'"));

КонецПроцедуры

#Область Прочее

&НаСервере
Функция ПредставлениеКласса(ABCКласс, XYZКласс)
	
	Результат = "";
	
	Если ABCКласс = Перечисления.ABCКлассификация.AКласс Тогда
		
		Результат = "A";
		
	ИначеЕсли ABCКласс = Перечисления.ABCКлассификация.BКласс Тогда
		
		Результат = "B";
		
	ИначеЕсли ABCКласс = Перечисления.ABCКлассификация.CКласс ИЛИ ABCКласс = Перечисления.ABCКлассификация.НеКлассифицирован Тогда
		
		Результат = "C";
		
	КонецЕсли;
	
	Если XYZКласс = Перечисления.XYZКлассификация.XКласс Тогда
		
		Результат = Результат + "X";
		
	ИначеЕсли XYZКласс = Перечисления.XYZКлассификация.YКласс Тогда
		
		Результат = Результат + "Y";
		
	ИначеЕсли XYZКласс = Перечисления.XYZКлассификация.ZКласс ИЛИ XYZКласс = Перечисления.XYZКлассификация.НеКлассифицирован Тогда
		
		Результат = Результат + "Z";
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти
